// data_20240820_8.js

const { baseUrl } = require('../config');

const shareConfig = {
    id: 8, // 唯一标识符
    title: "逆子的聊天记录", // 微信分享标题
    description: "逆子:牛羊鼠兔\n逆子:狗虎龙\n聊天记录", // 微信分享描述
    link: `${baseUrl}/path/to/page`, // 使用全局域名
    imgUrl: `${baseUrl}/images/zhandianIcon.jpg`, // 使用全局域名
    messageDate: "21:19", // 消息日期
    sequence: 8, // 序号，表示当天的第几条消息
    records: [
        {
            user: "逆子",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "牛羊鼠兔各数 40狗虎龙各数60",
            time: "20:18"
        },
        {
            user: "逆子",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "06 18 20 44 08 21 33 45 12 30 04 28 01 13 25 14 28 03 15 各70",
            time: "20:23"
        },
        {
            user: "逆子",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "08-18-27-29-32-34各45米，03-05-10-14-15-22-26-31-38-44-46各25米",
            time: "20:24"
        },
        {
            user: "逆子",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "33.25.47.36.18.24.06.39.18.43.48.02.31.10.09.16.30.15.04.46.22各80",
            time: "20:27"
        },
        {
            user: "逆子",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "22.14.15.32.01.12.40.27.16.29.39.33.35.09.24.18.14.40各号100",
            time: "20:29"
        },
        {
            user: "逆子",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "38.20.39.12.16.24.29.17.12.40.27.16.29.39.33.48.07.26.34.27.16各号75",
            time: "20:29"
        },
        {
            user: "逆子",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "14.15.32.01.12.40.27.16.29.39.33.35.26.18.11.17.36.39.42各号40",
            time: "20:29"
        },
        {
            user: "逆子",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "38.26.24.28.23.43.47.42.32.27.19.25.09.29.03.34.32.39.28.25.17.46.10.13各号35",
            time: "20:29"
        },

        
    ]
};

module.exports = shareConfig;
