// data_20240820_7.js

const { baseUrl } = require('../config');

const shareConfig = {
    id: 7, // 唯一标识符
    title: "德玛的聊天记录", // 微信分享标题
    description: "德玛:05.39.48.07\n德玛:26.34.27.16\n聊天记录", // 微信分享描述
    link: `${baseUrl}/path/to/page`, // 使用全局域名
    imgUrl: `${baseUrl}/images/zhandianIcon.jpg`, // 使用全局域名
    messageDate: "21:19", // 消息日期
    sequence: 7, // 序号，表示当天的第几条消息
    records: [
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "02.06.18.33.08.34.16/各3米14.12.24.13.25.各10 ,21.20.22.39.09/各100米26.05.17.14.37/各5米",
            time: "20:18"
        },
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "马牛鸡狗，各号十.，龙侯虎鼠各号五，44.40.各20米。32.28各10米，04.16.08.20各5米，18/30/22/46各三十，24，21.33各5米蛇个号五十，12/24各200，08/44各五，18.30各10 ,  10.34.46.06各5",
            time: "20:23"
        },
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "牛，鼠，鸡，虎，猪各号5块",
            time: "20:24"
        },
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "33,44,01,45,02,05,27,38,49,06,28,39,07,29,08,40,30,21,32,43各3",
            time: "20:27"
        },
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "04-06-10-11-13-15-16-17-18-26-43-44-45-46-47-08各5块,14****200块,40.36各20,   10.39.41各10块",
            time: "20:29"
        },

        
    ]
};

module.exports = shareConfig;
