// data_20240820_15.js

const { baseUrl } = require('../config');

const shareConfig = {
    id: 15, // 唯一标识符
    title: "忍者的聊天记录", // 微信分享标题
    description: "忍者:牛羊鼠兔\n忍者:狗虎龙\n聊天记录", // 微信分享描述
    link: `${baseUrl}/path/to/page`, // 使用全局域名
    imgUrl: `${baseUrl}/images/zhandianIcon.jpg`, // 使用全局域名
    messageDate: "21:19", // 消息日期
    sequence: 15, // 序号，表示当天的第几条消息
    records: [
        {
            user: "忍者",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "牛羊鼠兔各数20 狗虎龙各数30",
            time: "19:40"
        },
        {
            user: "忍者",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "08-18-27-29-32-34各15 03-05-10-14-15-22-26-31-38-44-46各10",
            time: "19:42"
        },
        {
            user: "忍者",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "08-18-27-29-32-34各30 03-05-10-14-15-22-26-31-38-44-46各20",
            time: "19:48"
        },
        {
            user: "忍者",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "38.26.24.28.23.43.47.42.32.27.19.25.09.29.03.34.32.39.28.25.17.46.10.13各号20",
            time: "19:49"
        },
        {
            user: "忍者",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "14.15.32.01.12.40.27.16.29.39.33.35.26.18.11.17.36.39.42各10",
            time: "19:55"
        },
        {
            user: "忍者",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "06 18 20 44 08 21 33 45 12 30 04 28 01 13 25 14 28 03 15 各50",
            time: "20:03"
        },
        {
            user: "忍者",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "38.20.39.12.16.24.29.17.12.40.27.16.29.39.33各10米 48.07.26.34.27.16各号10米",
            time: "20:05"
        },
        {
            user: "忍者",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "22.14.15.32.01.12.40.27.16.29.39.33.35.09.24.18.14.40各5米",
            time: "20:08"
        },
        {
            user: "忍者",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "33.25.47各15米\n36.18.24.06.39.18.43.48.02.31.10.09.16.30.15.04.46.22各10米",
            time: "20:10"
        },
        {
            user: "忍者",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "01.11.21.31.41.05.15.25.35.45.10.20.30.40各5米",
            time: "20:12"
        },



        
    ]
};

module.exports = shareConfig;
