// data_20240820_6.js

const { baseUrl } = require('../config');

const shareConfig = {
    id: 6, // 唯一标识符
    title: "德玛的聊天记录", // 微信分享标题
    description: "德玛:05.39.48.07\n德玛:26.34.27.16\n聊天记录", // 微信分享描述
    link: `/`, // 使用全局域名
    imgUrl: `${baseUrl}/images/zhandianIcon.jpg`, // 使用全局域名
    messageDate: "21:19", // 消息日期
    sequence: 6, // 序号，表示当天的第几条消息
    records: [
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "05.39.48.07.26.34.27.16.33.45.43.15.18.42.31.03.09.22.26.18.11.17.36.39.42.14各号65",
            time: "20:18"
        },
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "14.15.32.01.12.40.27.16.29.39.33.35.26.18.11.17.36.39.42各号40",
            time: "20:23"
        },
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "38.20.39.12.16.24.29.17.12.40.27.16.29.39.33.48.07.26.34.27.16各号75",
            time: "20:24"
        },
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "13.15.26.04.35.09.26.37.34.39.47.45.03.07.09.21各号50",
            time: "20:27"
        },
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "22.14.15.32.01.12.40.27.16.29.39.33.35.09.24.18.14.40各号100",
            time: "20:29"
        },
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "38.26.24.28.23.43.47.42.32.27.19.25.09.29.03.34.32.39.28.25.17.46.10.13各号35",
            time: "20:34"
        },
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "41.36.04.38.20.39.12.16.24.29.17.23.40.21.01.18.44.42.35.45.18各号70",
            time: "20:29"
        },
        {
            user: "德玛",
            avatar: "/images/20240905_1.jpg", // 本地图片路径
            numbers: "33.25.47.36.18.24.06.39.18.43.48.02.31.10.09.16.30.15.04.46.22各80",
            time: "20:34"
        },
        
    ]
};

module.exports = shareConfig;
